---
kind: type
id: T:Autodesk.Revit.DB.TextNoteOptions
source: html/b0fd6ef8-a0ef-9cf4-5bc2-8cd65f81f648.htm
---
# Autodesk.Revit.DB.TextNoteOptions

Options to use when creating a new text note element.

## Syntax (C#)
```csharp
public class TextNoteOptions : IDisposable
```

## Remarks
Use an instance of this class as an argument in the TextNote.Create methods.